// Reference:
// https://github.com/opentypejs/opentype.js/blob/c37fcdfbd89c1bd0aac1cecb2b287dfb7d00cee0/src/types.js#L463-L482

#[rustfmt::skip]
const GREEK: [char; 128] = [
    'Ä', '¹', '²', 'É', '³', 'Ö', 'Ü', '΅', 'à', 'â', 'ä', '΄', '¨',
    'ç', 'é', 'è', 'ê', 'ë', '£', '™', 'î', 'ï', '•', '½', '‰', 'ô',
    'ö', '¦', '€', 'ù', 'û', 'ü', '†', 'Γ', 'Δ', 'Θ', 'Λ', 'Ξ', 'Π',
    'ß', '®', '©', 'Σ', 'Ϊ', '§', '≠', '°', '·', 'Α', '±', '≤', '≥',
    '¥', 'Β', 'Ε', 'Ζ', 'Η', 'Ι', 'Κ', 'Μ', 'Φ', 'Ϋ', 'Ψ', 'Ω', 'ά',
    'Ν', '¬', 'Ο', 'Ρ', '≈', 'Τ', '«', '»', '…', ' ', 'Υ', 'Χ', 'Ά',
    'Έ', 'œ', '–', '―', '“', '”', '‘', '’', '÷', 'Ή', 'Ί', 'Ό', 'Ύ',
    'έ', 'ή', 'ί', 'ό', 'Ώ', 'ύ', 'α', 'β', 'ψ', 'δ', 'ε', 'φ', 'γ',
    'η', 'ι', 'ξ', 'κ', 'λ', 'μ', 'ν', 'ο', 'π', 'ώ', 'ρ', 'σ', 'τ',
    'θ', 'ω', 'ς', 'χ', 'υ', 'ζ', 'ϊ', 'ϋ', 'ΐ', 'ΰ', '\u{00AD}',
];

#[rustfmt::skip]
const ROMAN: [char; 128] = [
    'Ä', 'Å', 'Ç', 'É', 'Ñ', 'Ö', 'Ü', 'á', 'à', 'â', 'ä', 'ã', 'å',
    'ç', 'é', 'è', 'ê', 'ë', 'í', 'ì', 'î', 'ï', 'ñ', 'ó', 'ò', 'ô',
    'ö', 'õ', 'ú', 'ù', 'û', 'ü', '†', '°', '¢', '£', '§', '•', '¶',
    'ß', '®', '©', '™', '´', '¨', '≠', 'Æ', 'Ø', '∞', '±', '≤', '≥',
    '¥', 'µ', '∂', '∑', '∏', 'π', '∫', 'ª', 'º', 'Ω', 'æ', 'ø', '¿',
    '¡', '¬', '√', 'ƒ', '≈', '∆', '«', '»', '…', ' ', 'À', 'Ã', 'Õ',
    'Œ', 'œ', '–', '—', '“', '”', '‘', '’', '÷', '◊', 'ÿ', 'Ÿ', '⁄',
    '€', '‹', '›', 'ﬁ', 'ﬂ', '‡', '·', '‚', '„', '‰', 'Â', 'Ê', 'Á',
    'Ë', 'È', 'Í', 'Î', 'Ï', 'Ì', 'Ó', 'Ô', '', 'Ò', 'Ú', 'Û', 'Ù',
    'ı', 'ˆ', '˜', '¯', '˘', '˙', '˚', '¸', '˝', '˛', 'ˇ',
];

#[rustfmt::skip]
const RUSSIAN: [char; 128] = [
    'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М',
    'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ',
    'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', '†', '°', 'Ґ', '£', '§', '•', '¶',
    'І', '®', '©', '™', 'Ђ', 'ђ', '≠', 'Ѓ', 'ѓ', '∞', '±', '≤', '≥',
    'і', 'µ', 'ґ', 'Ј', 'Є', 'є', 'Ї', 'ї', 'Љ', 'љ', 'Њ', 'њ', 'ј',
    'Ѕ', '¬', '√', 'ƒ', '≈', '∆', '«', '»', '…', ' ', 'Ћ', 'ћ', 'Ќ',
    'ќ', 'ѕ', '–', '—', '“', '”', '‘', '’', '÷', '„', 'Ў', 'ў', 'Џ',
    'џ', '№', 'Ё', 'ё', 'я', 'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з',
    'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф',
    'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', '\u{FFFD}',
];

#[rustfmt::skip]
const SLAVIC: [char; 128] = [
    'Ä', 'Ā', 'ā', 'É', 'Ą', 'Ö', 'Ü', 'á', 'ą', 'Č', 'ä', 'č', 'Ć',
    'ć', 'é', 'Ź', 'ź', 'Ď', 'í', 'ď', 'Ē', 'ē', 'Ė', 'ó', 'ė', 'ô',
    'ö', 'õ', 'ú', 'Ě', 'ě', 'ü', '†', '°', 'Ę', '£', '§', '•', '¶',
    'ß', '®', '©', '™', 'ę', '¨', '≠', 'ģ', 'Į', 'į', 'Ī', '≤', '≥',
    'ī', 'Ķ', '∂', '∑', 'ł', 'Ļ', 'ļ', 'Ľ', 'ľ', 'Ĺ', 'ĺ', 'Ņ', 'ņ',
    'Ń', '¬', '√', 'ń', 'Ň', '∆', '«', '»', '…', ' ', 'ň', 'Ő', 'Õ',
    'ő', 'Ō', '–', '—', '“', '”', '‘', '’', '÷', '◊', 'ō', 'Ŕ', 'ŕ',
    'Ř', '‹', '›', 'ř', 'Ŗ', 'ŗ', 'Š', '‚', '„', 'š', 'Ś', 'ś', 'Á',
    'Ť', 'ť', 'Í', 'Ž', 'ž', 'Ū', 'Ó', 'Ô', 'ū', 'Ů', 'Ú', 'ů', 'Ű',
    'ű', 'Ų', 'ų', 'Ý', 'ý', 'ķ', 'Ż', 'Ł', 'ż', 'Ģ', 'ˇ',
];

pub fn decode(bytes: &[u8], encoding_id: u16) -> Option<String> {
    let table = match encoding_id {
        0 => &ROMAN, // Roman
        // 1 => Japanese
        // 2 => Chinese (Traditional)
        // 3 => Korean
        // 4 => Arabic
        // 5 => Hebrew
        6 => &GREEK,   // Greek
        7 => &RUSSIAN, // Russian
        // 8 => RSymbol
        // 9 => Devanagari
        // 10 => Gurmukhi
        // 11 => Gujarati
        // 12 => Oriya
        // 13 => Bengali
        // 14 => Tamil
        // 15 => Telugu
        // 16 => Kannada
        // 17 => Malayalam
        // 18 => Sinhalese
        // 19 => Burmese
        // 20 => Khmer
        // 21 => Thai
        // 22 => Laotian
        // 23 => Georgian
        // 24 => Armenian
        // 25 => Chinese (Simplified)
        // 26 => Tibetan
        // 27 => Mongolian
        // 28 => Geez
        29 => &SLAVIC, // Slavic
        // 30 => Vietnamese
        // 31 => Sindhi
        // 32 => Uninterpreted
        _ => return None,
    };

    let mut string = String::new();
    for &byte in bytes {
        if byte <= 0x7F {
            string.push(byte as char);
        } else {
            string.push(table[(byte & 0x7F) as usize]);
        }
    }

    Some(string)
}
